
  {
    "products": [
      {
        "id": 1,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/sexyshad20_101296832_main?_a=AJFJtWIA",
        "brand": "Rapala",
        "heading": "Original Floating Minnow",
        "rating": 4.5,
        "price": 8.99,
        "description": "The Rapala Original Floating Minnow is a classic fishing lure that has been catching fish for over 80 years. Its balsa wood construction allows it to float on the surface, creating a lifelike action that attracts fish. This lure is great for both freshwater and saltwater fishing."
      },
      {
        "id": 2,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/prismbrown_1407030701444_main?_a=AJFJtWIA",
        "brand": "Berkley",
        "heading": "Gulp! Alive! Swimming Mullet",
        "rating": 4.2,
        "price": 6.99,
        "description": "The Berkley Gulp! Alive! Swimming Mullet is a soft plastic lure that is infused with a powerful attractant to enhance its effectiveness. The swimming tail design creates a lifelike action in the water that attracts fish. This lure is great for targeting a variety of saltwater species."
      },
      {
        "id": 3,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/crystalcrawdad_77814_main?_a=AJFJtWIA",
        "brand": "Mach",
        "heading": "Buzzbait",
        "rating": 4.7,
        "price": 4.99,
        "description": "The Mach Buzzbait is a topwater lure that creates a loud buzzing sound to attract fish. Its unique design allows it to skim over the surface of the water, creating a lifelike action that mimics a fleeing baitfish. This lure is great for targeting bass and other freshwater species."
      },
      {
        "id": 4,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/firecraw_100903088_main?_a=AJFJtWIA",
        "brand": "Salmo",
        "heading": "Hornet",
        "rating": 4.3,
        "price": 9.99,
        "description": "The Salmo Hornet is a crankbait lure that is designed to imitate a variety of small baitfish. Its realistic swimming action and rattling sound make it irresistible to predatory fish. This lure is great for both freshwater and saltwater fishing."
      },
      {
        "id": 5,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_269/v1/ProductImages/100/aurorablack_101261692_main?_a=AJFJtWIA",
        "brand": "Bass Pro Shops",
        "heading": "XPS Z9R Perch Swimbait",
        "rating": 4.1,
        "price": 12.99,
        "description": "The Bass Pro Shops XPS Z9R Perch Swimbait is a realistic soft plastic lure that imitates a perch. Its lifelike swimming action and natural coloration make it a great choice for targeting predatory fish. This lure is great for both freshwater and saltwater fishing."
      },
      {
        "id": 6,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/firecraw_101285847_main?_a=AJFJtWIA",
        "brand": "Cabela's",
        "heading": "Northern Flight Mallard Duck Decoy",
        "rating": 4.8,
        "price": 19.99,
        "description": "The Cabela's Northern Flight Mallard Duck Decoy is a realistic decoy that is designed to attract ducks. Its lifelike appearance and realistic movements make it "
      
      },
      {
        "id": 7,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/carolinachrome_100317771_main?_a=AJFJtWIA",
        "brand": "Rapala",
        "heading": "Jointed Shad Rap",
        "rating": 4.6,
        "price": 10.99,
        "description": "The Rapala Jointed Shad Rap is a popular fishing lure that is designed to imitate a wounded baitfish. Its jointed body creates a realistic swimming action that attracts predatory fish. This lure is great for both freshwater and saltwater fishing."
      },
      {
        "id": 8,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/lovestruck_101091045_main?_a=AJFJtWIA",
        "brand": "Berkley",
        "heading": "PowerBait Power Worms",
        "rating": 4.0,
        "price": 5.99,
        "description": "The Berkley PowerBait Power Worms are soft plastic lures that are infused with a powerful attractant to enhance their effectiveness. Their realistic design and lifelike action make them a great choice for targeting a variety of freshwater species."
      },
      {
        "id": 9,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/crawfishorangebelly_1703_main?_a=AJFJtWIA",
        "brand": "Mach",
        "heading": "Spinnerbait",
        "rating": 4.4,
        "price": 7.99,
        "description": "The Mach Spinnerbait is a versatile fishing lure that is great for targeting a variety of freshwater species. Its spinning blade creates a lifelike action in the water that attracts predatory fish. This lure is great for both beginners and experienced anglers."
      },
      {
        "id": 10,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_269/v1/ProductImages/100/silverado_100190745_main?_a=AJFJtWIA",
        "brand": "Salmo",
        "heading": "Rattlin' Hornet",
        "rating": 4.2,
        "price": 8.99,
        "description": "The Salmo Rattlin' Hornet is a crankbait lure that is designed to imitate a variety of small baitfish. Its realistic swimming action and rattling sound make it irresistible to predatory fish. This lure is great for both freshwater and saltwater fishing."
      },
      {
        "id": 11,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/prismchartsilver_1307020606163_main?_a=AJFJtWIA",
        "brand": "Bass Pro Shops",
        "heading": "XPS Rattle Shad",
        "rating": 4.3,
        "price": 7.99,
        "description": "The Bass Pro Shops XPS Rattle Shad is a crankbait lure that is designed to imitate a variety of small baitfish. Its rattling sound and lifelike swimming action make it a great choice for targeting predatory fish. This lure is great for both freshwater and saltwater fishing."
      },
      {
        "id": 12,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/chrome_101297511_main?_a=AJFJtWIA",
        "brand": "Cabela's",
        "heading": "Northern Flight Mallard Hen Decoy",
        "rating": 4.8,
        "price": 19.99,
        "description": "The Cabela's Northern Flight Mallard Hen Decoy is a realistic decoy that is designed to attract ducks. Its lifelike appearance and realistic movements make it a great addition to any duck hunting setup. This decoy is made from durable materials and is designed to withstand harsh weather conditions."
      },
      {
        "id": 13,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/purpleshad_100885669_main?_a=AJFJtWIA",
        "brand": "Rapala",
        "heading": "CountDown",
        "rating": 4.5,
        "price": 9.99,
        "description": "The Rapala CountDown is a versatile fishing lure that can be used to target a variety of freshwater and saltwater species. Its slow sinking action and lifelike swimming motion make it a great choice for targeting wary fish. This lure is available in a variety of colors and sizes to match the local forage."
      },
      {
        "id": 14,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/browncrayfish_2024_main?_a=AJFJtWIA",
        "brand": "Berkley",
        "heading": "Gulp! Alive! Minnows",
        "rating": 4.2,
        "price": 7.99,
        "description": "The Berkley Gulp! Alive! Minnows are soft plastic lures that are infused with a powerful attractant to enhance their effectiveness. Their lifelike appearance and scent make them a great choice for targeting a variety of freshwater species. These lures come in a resealable container to keep them fresh and easy to store."
      },
      {
        "id": 15,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/crystalcrawdad_77814_main?_a=AJFJtWIA",
        "brand": "Mach",
        "heading": "Jighead",
        "rating": 4.3,
        "price": 6.99,
        "description": "The Mach Jighead is a versatile fishing lure that can be used with a variety of soft plastic baits. Its unique design allows it to be fished in a variety of ways, making it a great choice for targeting a variety of freshwater species. This lure is available in a variety of sizes and weights to match the local conditions."
      },
      {
        "id": 16,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/firecraw_100835318_main?_a=AJFJtWIA",
        "brand": "Salmo",
        "heading": "Hornet",
        "rating": 4.4,
        "price": 8.99,
        "description": "The Salmo Hornet is a versatile fishing lure that can be used to target a variety of freshwater species. Its lifelike appearance and swimming action make it a great choice for targeting predatory fish. This lure is available in a variety of colors and sizes to match the local forage."
      },
      {
        "id": 17,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/brownscalecraw_101042789_main?_a=AJFJtWIA",
        "brand": "Bass Pro Shops",
        "heading": "XPS Lazer Eye",
        "rating": 4.2,
        "price": 7.99,
        "description": "The Bass Pro Shops XPS Lazer Eye is a crankbait lure that is designed to imitate a variety of small baitfish. Its lifelike appearance and swimming action make it a great choice for targeting predatory fish. This lure is available in a variety of colors and sizes to match the local forage."
      },
      {
        "id": 18,
        "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/jackwagon_100122248_main?_a=AJFJtWIAhttps://example.com/lure18.jpg",
        "brand": "Cabela's",
        "heading": "Northern Flight Gadwall Decoy",
        "rating": 4.6,
        "price": 19.99,
        "description": "The Cabela's Northern Flight Gadwall Decoy is a realistic decoy that is designed to attract ducks. Its lifelike appearance and realistic movements make it a great addition to any duck hunting setup. This decoy is made from durable materials and features a weighted keel for stability in rough."
        
      },
      {
      "id": 19,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/hottiger_100885659_main?_a=AJFJtWIA",
      "brand": "Rapala",
      "heading": "Shad Rap",
      "rating": 4.8,
      "price": 10.99,
      "description": "The Rapala Shad Rap is a classic fishing lure that has been used by anglers for decades. Its lifelike appearance and swimming action make it a great choice for targeting a variety of freshwater species. This lure is available in a variety of colors and sizes to match the local forage."
      },
      {
      "id": 20,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/hotperch_100885678_main?_a=AJFJtWIA",
      "brand": "Berkley",
      "heading": "PowerBait MaxScent The General",
      "rating": 4.7,
      "price": 6.99,
      "description": "The Berkley PowerBait MaxScent The General is a soft plastic stick bait that is infused with a powerful attractant to enhance its effectiveness. Its unique texture and scent make it a great choice for targeting a variety of freshwater species. This lure is available in a variety of colors to match the local forage."
      },
      {
      "id": 21,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/browncraw_101295532_main?_a=AJFJtWIA",
      "brand": "Mach",
      "heading": "Spinnerbait",
      "rating": 4.2,
      "price": 7.99,
      "description": "The Mach Spinnerbait is a versatile fishing lure that can be used to target a variety of freshwater species. Its flashy blades and lifelike skirt make it a great choice for targeting predatory fish. This lure is available in a variety of colors and sizes to match the local conditions."
      },
      {
      "id": 22,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/sexyshad20_101296831_main?_a=AJFJtWIA",
      "brand": "Salmo",
      "heading": "Slider",
      "rating": 4.5,
      "price": 8.99,
      "description": "The Salmo Slider is a versatile fishing lure that can be used to target a variety of freshwater species. Its lifelike appearance and swimming action make it a great choice for targeting predatory fish. This lure is available in a variety of colors and sizes to match the local forage."
      },
      {
      "id": 23,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/sexyshad20_101296832_main?_a=AJFJtWIA",
      "brand": "Bass Pro Shops",
      "heading": "XPS Z9R Perch",
      "rating": 4.3,
      "price": 7.99,
      "description": "The Bass Pro Shops XPS Z9R Perch is a crankbait lure that is designed to imitate a variety of small baitfish. Its lifelike appearance and swimming action make it a great choice for targeting predatory fish. This lure is available in a variety of colors and sizes to match the local forage."
      },
      {
      "id": 24,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/crawfishorangebelly_1703_main?_a=AJFJtWIA",
      "brand": "Cabela's",
      "heading": "Northern Flight Mallard Decoys",
      "rating": 4.7,
      "price": 39.99,
      "description": "The Cabela's Northern Flight Mallard Decoys are realistic decoys that are designed to attract ducks. Their lifelike appearance and realistic movements make them a great addition to any duck hunting setup"
      
    },
    {
      "id": 25,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/chartreusepikey_18688_main?_a=AJFJtWIA",
      "brand": "Rapala",
      "heading": "Rattlin' Rap",
      "rating": 4.6,
      "price": 9.99,
      "description": "The Rapala Rattlin' Rap is a classic fishing lure that has been used by anglers for decades. Its unique rattle system and lifelike appearance make it a great choice for targeting a variety of freshwater species. This lure is available in a variety of colors and sizes to match the local forage."
    },
    {
      "id": 26,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/bluechrome_101048790_main?_a=AJFJtWIA",
      "brand": "Berkley",
      "heading": "Gulp! Alive! Swimming Mullet",
      "rating": 4.4,
      "price": 8.99,
      "description": "The Berkley Gulp! Alive! Swimming Mullet is a soft plastic bait that is infused with a powerful attractant to enhance its effectiveness. Its lifelike appearance and swimming action make it a great choice for targeting a variety of saltwater species. This lure is available in a variety of colors to match the local forage."
    },
    {
      "id": 27,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/bone_100181234_main?_a=AJFJtWIA",
      "brand": "Mach",
      "heading": "Jerkbait",
      "rating": 4.3,
      "price": 7.99,
      "description": "The Mach Jerkbait is a versatile fishing lure that can be used to target a variety of freshwater species. Its lifelike appearance and swimming action make it a great choice for targeting predatory fish. This lure is available in a variety of colors and sizes to match the local conditions."
    },
    {
      "id": 28,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/coldshad_101285845_main?_a=AJFJtWIA",
      "brand": "Salmo",
      "heading": "Perch",
      "rating": 4.6,
      "price": 8.99,
      "description": "The Salmo Perch is a versatile fishing lure that can be used to target a variety of freshwater species. Its lifelike appearance and swimming action make it a great choice for targeting predatory fish. This lure is available in a variety of colors and sizes to match the local forage."
    },
    {
      "id": 29,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/purpleshad_100885669_main?_a=AJFJtWIA",
      "brand": "Bass Pro Shops",
      "heading": "XPS Z9R Swimbait",
      "rating": 4.5,
      "price": 8.99,
      "description": "The Bass Pro Shops XPS Z9R Swimbait is a soft plastic bait that is designed to imitate a variety of small baitfish. Its lifelike appearance and swimming action make it a great choice for targeting predatory fish. This lure is available in a variety of colors and sizes to match the local forage."
    },
    {
      "id": 30,
      "image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/prismchartsilver_1307020606163_main?_a=AJFJtWIA",
      "brand": "Cabela's",
      "heading": "Northern Flight Blue-Winged Teal Decoys",
      "rating": 4.7,
      "price": 39.99,
      "description": " the cabals's skiiter topwater target v variety of freshwater hunting setup. These decoys are made from durable materials."
      
},
{
"id": 31,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/firecraw_100903088_main?_a=AJFJtWIA",
"brand": "Rapala",
"heading": "Skitter V",
"rating": 4.5,
"price": 10.99,
"description": "The Rapala Skitter V is a versatile topwater lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating fleeing baitfish. This lure is available in a variety of colors and sizes to match the local forage."
},
{
"id": 32,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/tablerockpro_101269258_main?_a=AJFJtWIA",
"brand": "Berkley",
"heading": "Gulp! Saltwater Swimming Mullet",
"rating": 4.4,
"price": 8.99,
"description": "The Berkley Gulp! Saltwater Swimming Mullet is a soft plastic bait that is infused with a powerful attractant to enhance its effectiveness. Its lifelike appearance and swimming action make it a great choice for targeting a variety of saltwater species. This lure is available in a variety of colors to match the local forage."
},
{
"id": 33,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/firecraw_101285847_main?_a=AJFJtWIA",
"brand": "Mach",
"heading": "Spinnerbait",
"rating": 4.3,
"price": 7.99,
"description": "The Mach Spinnerbait is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating fleeing baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 34,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/bone_101049423_main?_a=AJFJtWIA",
"brand": "Salmo",
"heading": "Fatso",
"rating": 4.6,
"price": 8.99,
"description": "The Salmo Fatso is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating fleeing baitfish. This lure is available in a variety of colors and sizes to match the local forage."
},
{
"id": 35,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/tablerockpro_101269258_main?_a=AJFJtWIA",
"brand": "Bass Pro Shops",
"heading": "XPS Tungsten Jig",
"rating": 4.5,
"price": 2.99,
"description": "The Bass Pro Shops XPS Tungsten Jig is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small aquatic insects. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 36,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/chrome_101297511_main?_a=AJFJtWIA",
"brand": "Cabela's",
"heading": "BigHorn Fly Reel",
"rating": 4.7,
"price": 149.99,
"description": "The Cabela's BigHorn Fly Reel is a high-quality fly reel that is designed for serious fly fishing enthusiasts. Its durable construction and smooth drag make it a great choice for targeting large freshwater species such as trout and salmon."

},
{
"id": 37,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/lovestruck_101091045_main?_a=AJFJtWIA",
"brand": "Rapala",
"heading": "Jigging Rap",
"rating": 4.5,
"price": 6.99,
"description": "The Rapala Jigging Rap is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small aquatic creatures. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 38,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/glitterpinkwhite_100318710_main?_a=AJFJtWIA",
"brand": "Berkley",
"heading": "Gulp! Alive! Jerk Shad",
"rating": 4.4,
"price": 9.99,
"description": "The Berkley Gulp! Alive! Jerk Shad is a soft plastic bait that is infused with a powerful attractant to enhance its effectiveness. Its lifelike appearance and swimming action make it a great choice for targeting a variety of saltwater species. This lure is available in a variety of colors to match the local forage."
},
{
"id": 39,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_269/v1/ProductImages/100/limelight_100072256_main?_a=AJFJtWIA",
"brand": "Mach",
"heading": "Crankbait",
"rating": 4.3,
"price": 7.99,
"description": "The Mach Crankbait is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 40,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_269/v1/ProductImages/100/aurorablack_101261692_main?_a=AJFJtWIA",
"brand": "Salmo",
"heading": "Sting",
"rating": 4.6,
"price": 8.99,
"description": "The Salmo Sting is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating fleeing baitfish. This lure is available in a variety of colors and sizes to match the local forage."
},
{
"id": 41,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_268/v1/ProductImages/100/gildedrainbowtrout_101246492_main?_a=AJFJtWIA",
"brand": "Bass Pro Shops",
"heading": "XPS Swimbait",
"rating": 4.5,
"price": 2.99,
"description": "The Bass Pro Shops XPS Swimbait is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small aquatic creatures. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 42,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_268/v1/ProductImages/100/bone_100162087_main?_a=AJFJtWIA",
"brand": "Cabela's",
"heading": "Three Forks Fly Rod",
"rating": 4.7,
"price": 99.99,
"description": "The Cabela's Three Forks FlyRod is a high-quality fly fishing rod that is suitable for both beginners and experienced anglers. Its lightweight design and smooth action make it a pleasure to cast, and its durable construction ensures that it will last for years to come. This rod is available in a variety of sizes to match your fly fishing setup."
},
{
"id": 43,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_269/v1/ProductImages/100/silverado_100190745_main?_a=AJFJtWIA",
"brand": "Rapala",
"heading": "Countdown",
"rating": 4.6,
"price": 8.99,
"description": "The Rapala Countdown is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 44,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/clearnastyshad_101130762_main?_a=AJFJtWIA",
"brand": "Berkley",
"heading": "PowerBait Trout Dough",
"rating": 4.4,
"price": 4.99,
"description": "The Berkley PowerBait Trout Dough is a versatile bait that can be used to target a variety of freshwater species. Its unique formula is designed to attract fish and encourage them to hold on longer, giving you more time to set the hook. This bait is available in a variety of colors and scents to match the local forage."
},
{
"id": 45,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/tennesseeshad_100336679_main?_a=AJFJtWIA",
"brand": "Mach",
"heading": "Topwater Frog",
"rating": 4.5,
"price": 6.99,
"description": "The Mach Topwater Frog is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating frogs and other small creatures. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 46,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/blackmamba_100120033_main?_a=AJFJtWIA",
"brand": "Salmo",
"heading": "Slider",
"rating": 4.7,
"price": 9.99,
"description": "The Salmo Slider is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating wounded baitfish. This lure is available in a variety of colors and sizes to match the local forage."
},
{
"id": 47,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/jollyrancher_100192603_main?_a=AJFJtWIA",
"brand": "Bass Pro Shops",
"heading": "Stump Jumper",
"rating": 4.5,
"price": 3.99,
"description": "The Bass Pro Shops Stump Jumper is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small aquatic creatures. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 48,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/carolinachrome_100317771_main?_a=AJFJtWIA",
"brand": "Cabela's",
"heading": "Fish Eagle Fly Reel",
"rating": 4.8,
"price": 149.99,
"description": 
"The Cabela's Fish Eagle Fly Reel is a high-quality reel that is designed to meet the needs of fly fishermen of all skill levels. Its durable construction and smooth drag system make it a pleasure to use."
},
{
"id": 49,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/aurorablack_101261691_main?_a=AJFJtWIA",
"brand": "Rapala",
"heading": "Jigging Rap",
"rating": 4.5,
"price": 6.99,
"description": "The Rapala Jigging Rap is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 50,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/prismchartsilver_1307020606163_main?_a=AJFJtWIA",
"brand": "Berkley",
"heading": "Flicker Shad",
"rating": 4.4,
"price": 4.99,
"description": "The Berkley Flicker Shad is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 51,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/purechrome_2827_main?_a=AJFJtWIA",
"brand": "Mach",
"heading": "Swim Jig",
"rating": 4.5,
"price": 5.99,
"description": "The Mach Swim Jig is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small aquatic creatures. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 52,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/black_1694_main?_a=AJFJtWIA",
"brand": "Salmo",
"heading": "Fury Popper",
"rating": 4.7,
"price": 8.99,
"description": "The Salmo Fury Popper is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small surface creatures. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 53,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/clearnastyshad_101130762_main?_a=AJFJtWIA",
"brand": "Bass Pro Shops",
"heading": "Bass Teaser",
"rating": 4.5,
"price": 3.99,
"description": "The Bass Pro Shops Bass Teaser is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small aquatic creatures. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 54,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/nestrobber_2952_main?_a=AJFJtWIA",
"brand": "Cabela's",
"heading": "Fish Eagle Fly Line",
"rating": 4.8,


"price": 39.99,
"description": "The Cabela's Fish Eagle Fly Line is a high-quality fly line that is designed to meet the needs of fly fishermen of all skill levels. Its durable construction and low memory make it a pleasure to use, while its welded loops ensure a smooth connection to your leader. This fly line is available in a variety of weights to match your fly fishing setup."
},
{
"id": 55,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/olviveghost_97043_main?_a=AJFJtWIA",
"brand": "Rapala",
"heading": "X-Rap",
"rating": 4.6,
"price": 8.99,
"description": "The Rapala X-Rap is a versatile fishing lure that can be used to target a variety of freshwater and saltwater species. Its unique design and lifelike appearance make it a great choice for imitating small baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 56,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/firecraw_101285847_main?_a=AJFJtWIA",
"brand": "Berkley",
"heading": "Gulp! Alive! Shrimp",
"rating": 4.4,
"price": 9.99,
"description": "The Berkley Gulp! Alive! Shrimp is a versatile fishing lure that can be used to target a variety of freshwater and saltwater species. Its unique design and lifelike appearance make it a great choice for imitating small crustaceans. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 57,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/prismbrown_1407030701444_main?_a=AJFJtWIA",
"brand": "Mach",
"heading": "Deep Diving Crankbait",
"rating": 4.5,
"price": 6.99,
"description": "The Mach Deep Diving Crankbait is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 58,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/purpleshad_100885669_main?_a=AJFJtWIA",
"brand": "Salmo",
"heading": "Bullhead",
"rating": 4.7,
"price": 8.99,
"description": "The Salmo Bullhead is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small aquatic creatures. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 59,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/crawfishorangebelly_1703_main?_a=AJFJtWIA",
"brand": "Bass Pro Shops",
"heading": "Tiny Trap",
"rating": 4.5,
"price": 2.99,
"description": "The Bass Pro Shops Tiny Trap is a versatile fishing lure that can be used to target a variety of freshwater species. Its unique design and lifelike appearance make it a great choice for imitating small baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
},
{
"id": 60,
"image": "https://res.cloudinary.com/bass-pro/image/upload/f_auto/q_auto/c_scale,w_260/v1/ProductImages/100/crawfishorangebelly_1703_main?_a=AJFJtWIA",
"brand": "Cabela's",
"heading": "Whopper Plopper",
"rating": 4.8,
"price": 12.99,
"description": "The Cabela's Whopper Plopper is a versatile fishing lure that can be used to target a variety of freshwater and saltwater species. Its unique design and lifelike appearance make it a great choice for imitating small baitfish. This lure is available in a variety of colors and sizes to match the local conditions."
}
]
}







      
